/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2023 Renesas Electronics Corporation. All rights reserved.

    RAA489206_VCELL_FAULT_DELAY_11_SCAN   = 0x0A,
    RAA489206_VCELL_FAULT_DELAY_12_SCAN   = 0x0B,
    RAA489206_VCELL_FAULT_DELAY_13_SCAN   = 0x0C,
    RAA489206_VCELL_FAULT_DELAY_14_SCAN   = 0x0D,
    RAA489206_VCELL_FAULT_DELAY_15_SCAN   = 0x0E,
    RAA489206_VCELL_FAULT_DELAY_16_SCAN   = 0x0F,
} e_raa489206_vcell_fault_delay_t;

/* over current delay: number of scan delays given by number in decimal. 0 indicates no delay*/
typedef enum e_raa489206_os_fault_delay
{
    RAA489206_OC_FAULT_DELAY_0_SCAN    = 0x00,
    RAA489206_OC_FAULT_DELAY_1_SCAN    = 0x01,
    RAA489206_OC_FAULT_DELAY_2_SCAN    = 0x02,
    RAA489206_OC_FAULT_DELAY_3_SCAN    = 0x03,
    RAA489206_OC_FAULT_DELAY_4_SCAN    = 0x04,
    RAA489206_OC_FAULT_DELAY_5_SCAN    = 0x05,
    RAA489206_OC_FAULT_DELAY_6_SCAN    = 0x06,
    RAA489206_OC_FAULT_DELAY_7_SCAN    = 0x07,
    RAA489206_OC_FAULT_DELAY_8_SCAN    = 0x08,
    RAA489206_OC_FAULT_DELAY_9_SCAN   = 0x09,
    RAA489206_OC_FAULT_DELAY_10_SCAN   = 0x0A,
    RAA489206_OC_FAULT_DELAY_11_SCAN   = 0x0B,
    RAA489206_OC_FAULT_DELAY_12_SCAN   = 0x0C,
    RAA489206_OC_FAULT_DELAY_13_SCAN   = 0x0D,
    RAA489206_OC_FAULT_DELAY_14_SCAN   = 0x0E,
    RAA489206_OC_FAULT_DELAY_15_SCAN   = 0x0F,
} e_raa489206_coc_doc_fault_delay_t;

/*Load detection options*/
typedef enum e_raa489206_ld_options
{
    RAA489206_LOAD_DETECTION_DISABLED        = 0x00,
    RAA489206_LOAD_DETECTION_ENABLED_1MOHM   = 0x01,
    RAA489206_LOAD_DETECTION_ENABLED_10KOHM  = 0x02,
    RAA489206_LOAD_DETECTION_RSV             = 0x03,
} e_raa489206_ld_options_t;

/*Load detection delay*/
typedef enum e_raa489206_ld_delay
{
    RAA489206_LOAD_DETECTION_DELAY_025_S           = 0x00,
    RAA489206_LOAD_DETECTION_DELAY_1_S             = 0x01,
    RAA489206_LOAD_DETECTION_DELAY_2_S             = 0x02,
    RAA489206_LOAD_DETECTION_DELAY_4_S             = 0x03,
} e_raa489206_ld_delay_t;

/*Number of samples averaged per measurement before reporting ETAUX results*/
typedef enum e_raa489206_etaux_avg
{
    RAA489206_ETAUX_1_SAMPLE         = 0x00,
    RAA489206_ETAUX_2_SAMPLES         = 0x01,
    RAA489206_ETAUX_4_SAMPLES         = 0x02,
    RAA489206_ETAUX_8_SAMPLES         = 0x03,
    RAA489206_ETAUX_16_SAMPLES        = 0x04,
    RAA489206_ETAUX_32_SAMPLES        = 0x05,
    RAA489206_ETAUX_64_SAMPLES        = 0x06,
    RAA489206_ETAUX_128_SAMPLES       = 0x07,
} e_raa489206_etaux_avg_t;

typedef enum e_raa489206_etaux_enable
{
    RAA489206_ETAUX_OFF               = 0x00,
    RAA489206_ETAUX_XT0               = 0x01,
    RAA489206_ETAUX_XT1               = 0x02,
    RAA489206_ETAUX_BOTH              = 0x03,
} e_raa489206_etaux_enable_t;

/*GPIO configuration bits*/
typedef enum e_raa489206_gpio_config
{
    RAA489206_GPIO_DIGITAL_INPUTS                  = 0x00,
    RAA489206_GPIO_DIGITAL_OUTPUTS                 = 0x01,
    RAA489206_GPIO_DRIVE_LED                       = 0x02,
    RAA489206_GPIO_PWR_FETS_GATE_DRIVE_OUT         = 0x03,
} e_raa489206_gpio_config_t;

/*2 bytes union with access to least significant byte*/
union u_two_byte_lsb
{
    uint16_t value;
    uint8_t lsb_value;

    struct
    {
        uint16_t lsb                    : 8;
        uint16_t msb                    : 8;
    } lsb_msb;
};

/*4 bytes union with access to least significant byte*/
union u_four_byte_lsb
{
    uint32_t value;
    uint8_t lsb;
};

/*Cells selection*/

typedef enum e_raa489206_cells_select
{
    RAA489206_CELLS_SELECT_16_CELLS                  = 0x0000FFFF,
    RAA489206_CELLS_SELECT_15_CELLS                  = 0x0000FEFF,
    RAA489206_CELLS_SELECT_14_CELLS                  = 0x0000FE7F,
    RAA489206_CELLS_SELECT_13_CELLS                  = 0x0000FC7F,
    RAA489206_CELLS_SELECT_12_CELLS                  = 0x0000FC3F,
    RAA489206_CELLS_SELECT_11_CELLS                  = 0x0000F83F,
    RAA489206_CELLS_SELECT_10_CELLS                  = 0x0000F81F,
    RAA489206_CELLS_SELECT_9_CELLS                   = 0x0000F01F,
    RAA489206_CELLS_SELECT_8_CELLS                   = 0x0000F00F,
    RAA489206_CELLS_SELECT_7_CELLS                   = 0x0000E00F,
    RAA489206_CELLS_SELECT_6_CELLS                   = 0x0000E007,
    RAA489206_CELLS_SELECT_5_CELLS                   = 0x0000C007,
    RAA489206_CELLS_SELECT_4_CELLS                   = 0x0000C003,
} e_raa489206_cells_select_t;

/**********************************************************************************************************************
 RAA489206 SYSTEM REGISTERS
***********************************************************************************************************************/

/**********************************************************************************************************************
 IC Device Details
***********************************************************************************************************************/

/* 0x00 Device product ID register*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t RSV                     : 1;    /*0x00.0 REserved*/
        uint8_t REVISION                : 3;    /*0x00.1...0x00.3 Product revision*/
        uint8_t ID                      : 4;    /*0x00.4...0x00.7 Last two digits of the part ID minus one*/

    } value_b;

} u_raa489206_productionid_reg_t;

/**********************************************************************************************************************
 Global IC Control
 ********************************************************************************************************************/

/* 0x01 Global operation register*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t SYS_SCAN_TRIGGER        : 1;    /*0x01.0 Initiate a system scan*/
        uint8_t SCAN_SEL                : 1;    /*0x01.1 Type os system scan*/
        uint8_t BUSY                    : 1;    /*0x01.2 Busy bit indicationg device status*/
        uint8_t RCAL                    : 1;    /*0x01.3 Recalibrate before another system scan*/
        uint8_t RCAL_LPM_EN             : 1;    /*0x01.4 Recalibrate in Low Power Mode*/
        uint8_t RCAL_VOS_TRIGGER        : 1;    /*0x01.5 Recalibrate Low voltage offset*/
        uint8_t RESET2IDLE              : 1;    /*0x01.6 Reset to idle*/
        uint8_t SFT_RST                 : 1;    /*0x01.7 Soft reset*/

    } value_b;

} u_raa489206_globalop_reg_t;

/**********************************************************************************************************************
 Vcell and Ipack Measurement
 **********************************************************************************************************************/

/* 0x02 Cell voltage operation*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t VCELL_TRIGGER           : 1;    /*0x02.0 1 initiates Vcell measurement*/
        uint8_t CLR_FAULTS_STATUS       : 1;    /*0x02.1 1 clears faults and status*/
        uint8_t VCELL_AVG               : 3;    /*0x01.2...0x04 Number of samples averaged */
        uint8_t CHRWUV                  : 1;    /*0x02.5 1 disables Vcell UV*/
        uint8_t DCHRWOV                : 1;    /*0x02.6 1 disables Vcell OV*/
        uint8_t VCELL_EN                : 1;    /*0x02.7 1 Enables Vcells scan within system scans*/
    } value_b;

} u_raa489206_vcellop_reg_t;

/* 0x03 Ipack operation*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t IPACK_TRIGGER           : 1;    /*0x03.0 initiates an Ipack measurement*/
        uint8_t IDIR_DELAY              : 1;    /*0x03.1 number of measurements to determine charge/discharge: 0=1, 1=3 readings*/
        uint8_t IPACK_AVG               : 3;    /*0x03.2...0x03.4 number of samples averaged before writing the result*/
        uint8_t OW_UPDATE               : 2;    /*0x03.5...0x03.6 Control how often the open-wire test is executed*/
        uint8_t IPACK_EN                : 1;    /*0x03.7 Set to 1 to enable Ipack measurements*/
    } value_b;

} u_raa489206_ipackop_reg_t;

/* 0x04-0x05 Cell select register*/
typedef union
{
    uint16_t value;
    uint8_t lsb_value;

    struct
    {
        uint16_t lsb                    : 8;
        uint16_t msb                    : 8;
    } lsb_msb;

    struct
    {
        uint16_t CELLS_1_8               : 8;
        uint16_t CELLS_9_16              : 8;
    } cells_group;

    struct
    {
        uint16_t CELL1                   : 1;    /*0x04.0 Cell 1*/
        uint16_t CELL2                   : 1;    /*0x04.1 Cell 2*/
        uint16_t CELL3                   : 1;    /*0x04.2 Cell 3*/
        uint16_t CELL4                   : 1;    /*0x04.3 Cell 4*/
        uint16_t CELL5                   : 1;    /*0x04.4 Cell 5*/
        uint16_t CELL6                   : 1;    /*0x04.5 Cell 6*/
        uint16_t CELL7                   : 1;    /*0x04.6 Cell 7*/
        uint16_t CELL8                   : 1;    /*0x04.7 Cell 8*/
        uint16_t CELL9                   : 1;    /*0x05.0 Cell 9*/
        uint16_t CELL10                  : 1;    /*0x05.1 Cell 10*/
        uint16_t CELL11                  : 1;    /*0x05.2 Cell 11*/
        uint16_t CELL12                  : 1;    /*0x05.3 Cell 12*/
        uint16_t CELL13                  : 1;    /*0x05.4 Cell 13*/
        uint16_t CELL14                  : 1;    /*0x05.5 Cell 14*/
        uint16_t CELL15                  : 1;    /*0x05.6 Cell 15*/
        uint16_t CELL16                  : 1;    /*0x05.7 Cell 16*/

    } cells;

} u_raa489206_cells_select_t;

/* 0x30-0x4F V cell voltage 2-byte registers: VCell = (regVal)x(VCELLStep) + (0.5)x(VCELLStep); VCELLStep = 73.54792uV.*/
typedef union u_two_byte_lsb u_raa489206_vcell_voltage_t;

/* 0x50-0x51V cell max delta voltage 2byte-registers: VCell = (regVal)x(VCELLStep); VCELLStep = 73.54792uV.*/
typedef union u_two_byte_lsb u_raa489206_vcell_max_delta_t;

/* 0x52-0x53 Ipack voltage register*/
typedef union u_two_byte_lsb u_raa489206_ipack_voltage_t;

/* 0x54-0x57 Ipack timer register*/
typedef union
{
    uint32_t value;
    uint8_t lsb_value;

    struct
    {
        uint32_t byte1              : 8;
        uint32_t byte2              : 8;
        uint32_t byte3              : 8;
        uint32_t byte4              : 8;
    } bytes_values;
} u_raa489206_ipack_timer_t;

/**********************************************************************************************************************
 Vcell fault detectors
***********************************************************************************************************************/
/* 0x06 Vcell over-voltage register*/
typedef uint8_t raa489206_vcell_ov_th_t;

/* 0x07 Vcell under-voltage register*/
typedef uint8_t raa489206_vcell_uv_th_t;

/* 0x08 Max Delta Threshold register*/
typedef uint8_t raa489206_vcell_max_delta_th_t;

/* 0x09 Fault Delay register*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t VCELL_FAULT_DELAY        : 4; /*0x09.1...0x09.3 enables scans delay for Vcell OV and UV faults */
        uint8_t ETAUX_FAULT              : 1; /*0x09.4 enables 3-scan delay for ETAUX voltage threshold*/
        uint8_t OTHER_FAULT_DELAY        : 1; /*0x09.5 enables 3-scans delay for Vcc,Vtmpf,Ireg1,Ireg2,Vbovf,Vbuvf,IOTF,IOTW faults*/
        uint8_t DELTA_VCELL_FAULT_DELAY  : 1; /*0x09.6 enables 3-scans delay for delta vcell fault*/
        uint8_t AUX_XTN_PULLUP           : 1; /*0x09.7 when set to t, internal resistors are connected bwtween AUX0/1 and Vcc*/
    } value_b;
} u_raa489206_vcell_fault_delay_t;

/**********************************************************************************************************************
 Ipack fault detectors
***********************************************************************************************************************/

/* 0x0A Discharge Short-Circuit Threshold*/
typedef uint8_t raa489206_dsc_threshold_t;

/* 0x0B Discharge over-current threshold*/
typedef uint8_t raa489206_doc_th_register_t;

/* 0x0C Discharge Short-Circuit Delay register. TODO: Check reserve bit implications*/
typedef uint8_t raa489206_dsc_delay_register_t;

/* 0x0D Over-current delay*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t COCD                    : 4; /*0x0D.0-0x0D.3 Discharge overcurrent delay*/
        uint8_t DOCD                    : 4; /*0x0D.4-0x0D.7 Charge overcurrent delay*/
    } value_b;
} u_raa489206_oc_delay_t;

/*0x0E Load/Charge Operations*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t RSV                    : 1; /*0x0E.0 Reserved bit*/
        uint8_t LDLP                   : 1; /*0x0E.1 Load detect while in power mode*/
        uint8_t FCDC                   : 1; /*0x0E.2 FET charge driver connect*/
        uint8_t CPWR                   : 1; /*0x0E.3 Configure power FET*/
        uint8_t ELR                    : 1; /*0x0E.4 Enable load recovery*/
        uint8_t ELD                    : 2; /*0x0E.5...0x0E.6 Enable load detection*/
        uint8_t CFD                    : 1; /*0x0E.7 Connect for discharge fault*/
    } value_b;
} u_raa489206_load_charge_oper_t;

/*0x0F Charge over-current threshold*/
typedef uint8_t raa489206_coc_th_register_t;

/**********************************************************************************************************************
 External Temperature / Auxiliary (ETAUX)
***********************************************************************************************************************/
/*0x11 Etaux Operation*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t ETAUX_TRIGGER                   : 1; /*0x11.0 Trigger setting to 1 triggers an ETAUX measurement*/
        uint8_t ETAUX_RSV1                      : 1; /*0x11.1 Reserve bit*/
        uint8_t ETAUX_AVG                       : 3; /*0x11.2...0x11.4 ETAUX averages*/
        uint8_t ETAUX_RSV5                      : 1; /*0x11.5 Reserve bit*/
        uint8_t ETAUX_ENABLE                    : 2; /*0x11.6...0x11.7 ETAUX enable. enables including ETAUX measurement in scan mode*/
    }value_b;

}u_raa489206_etauxop_register_t;

/**********************************************************************************************************************
 Alert and GPIO
***********************************************************************************************************************/
/*0x12 Alert and General purpose I/O*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t GPIO_STATUS                     : 4; /*0x12.0...0x12.3 Status of each GPIO pin*/
        uint8_t GPIO_CONFIG                     : 2; /*0x12.4...0x12.5 Configuration of GPIO pins*/
        uint8_t ALRT_PULSE_EN                   : 1; /*0x12.6 Alert pulse enable*/
        uint8_t ALRT_ASSERT                     : 1; /*0x12.7 Alert pin assertion*/
    }value_b;

}u_raa489206_gpio_alrt_op_reg_t;

/**********************************************************************************************************************
 ETAUX Detectors
***********************************************************************************************************************/
/* 0x13...0x1A Under-temperature and over-temperature ETAUX thresholds*/
typedef uint8_t raa489206_cut0_threshold_t;
typedef uint8_t raa489206_cut1_threshold_t;
typedef uint8_t raa489206_dut0_threshold_t;
typedef uint8_t raa489206_dut1_threshold_t;
typedef uint8_t raa489206_cot0_threshold_t;
typedef uint8_t raa489206_cot1_threshold_t;
typedef uint8_t raa489206_dot0_threshold_t;
typedef uint8_t raa489206_dot1_threshold_t;

/* 0x58 2-bytes ETAUX0 Voltage*/
typedef union u_two_byte_lsb raa489206_xt0_aux0_voltage_t;
/* 0x5A 2-bytes ETAUX1 Voltage*/
typedef union u_two_byte_lsb raa489206_xt1_aux1_voltage_t;
typedef uint8_t raa489206_cut1_threshold_t;
typedef uint8_t raa489206_dut0_threshold_t;
typedef uint8_t raa489206_dut1_threshold_t;
typedef uint8_t raa489206_cot0_threshold_t;
typedef uint8_t raa489206_cot1_threshold_t;
typedef uint8_t raa489206_dot0_threshold_t;
typedef uint8_t raa489206_dot1_threshold_t;

/**********************************************************************************************************************
 Internal temperature
***********************************************************************************************************************/
/*0x22 Internal over temperature warning register*/
typedef uint8_t raa489206_iotw_th_t;

/*0x23 Internal over temperature fault register*/
typedef uint8_t raa489206_iotf_th_t;

/*Internal temperature register 0x5E*/
typedef uint8_t raa489206_internal_temperature_t;

/**********************************************************************************************************************
 Regulator Measurements and Detectors
***********************************************************************************************************************/
/*0x1B Vreg Operation register*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t VREG_TRIGGER            : 1; /* 0x1B.0 setting to 1 starts measurement of Vcc, Vvtem and Ireg*/
        uint8_t LP_REG                  : 1; /* 0x1B.1 selects the regulator that is on during LPM. 1 = strong, 0=weak*/
        uint8_t LD_DELAY                : 2; /* 0x1B.2...0x1B.3 Load Detect time delay (in s) before testing for load*/
        uint8_t UPDATE_OTHER            : 2; /* 0x1B.4...0x1B.5 Number of scans before ETAUX, Vbat1, Vcc, Ireg, Vtemp
                                                and IT are measured*/
        uint8_t COMM_TIMEOUT            : 2; /* 0x1B.6...0x1B.7 timeout period (in ms) to transition to LPM when no
                                                communication is receiveD*/
    }value_b;
} u_raa489206_vregop_register_t;

/*0x1C Vcc minimuim threshold register*/
typedef uint8_t raa489206_vcc_min_th_t;

/*0x1D IREGoc1 threshold - Limit compare to while the device is in SCAN or IDLE mode*/
typedef uint8_t raa489206_ireg_oc1_th_t;

/*0x1E IREGoc2 threshold - Limit compare to while the device is in Low Power Mode*/
typedef uint8_t raa489206_ireg_oc2_th_t;

/*0x5F Vvtemo Voltage: result from the measurement of the Vtemp pin voltage*/
typedef uint8_t raa489206_vtemp_voltage_t;

/*0x60 Vcc voltage*/
typedef uint8_t raa489206_vcc_voltage_t;

/*0x60-0x62 2-byte Ireg voltage*/
typedef union u_two_byte_lsb raa489206_ireg_voltage_t;

/**********************************************************************************************************************
 Vbat
***********************************************************************************************************************/
/*0x1F Vbat operation register */
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t  VBAT_TRIGGER           : 1; /*0x1F.0 setting to 1 triggers a Vbat measurement*/
        uint8_t  COM_TIMEOUT_EN         : 1; /*0x1F.1 Communication timeout enable*/
        uint8_t  OTHER_AVG              : 3; /*0x1F.2..0x1F.4 Number of samples to be averages before passing results*/
        uint8_t  ITEMP_TRIGGER          : 1; /*0x1F.5 setting to 1 starts an Itemp measurement*/
        uint8_t  ITEMP_ENABLE           : 1; /*0x1F.6 setting to 1 includes Itemp measurement during scans*/
        uint8_t  VBAT_ENABLE            : 1; /*0x1F.7 setting to 1 includes Vbat1 measurement during scans*/
    } value_b;
} u_raa489206_vbatop_register_t;


/*0x20 Vbat1 over-voltage register*/
typedef uint8_t raa489206_vbat1_ov_th_t;

/*0x21 Vbat1 under-voltage register*/
typedef uint8_t raa489206_vbat1_uv_th_t;

/*Vbat voltage 0x5C - 0x5D*/
typedef union u_two_byte_lsb u_raa489206_vbat1_register_t;

/**********************************************************************************************************************
 Power FET Controls and Open-Wire
***********************************************************************************************************************/
/*Power FET Operation 0x24*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t CFET_EN                         : 1; /*0x24.0 Charge FET enable. 1 activates CFET unless prevented by a related fault*/
        uint8_t DFET_EN                         : 1; /*0x24.1 Discharge FET enable. 1 activates CFET unless prevented by a related fault*/
        uint8_t ETA_CON                         : 1; /*0x24.2 External temperature and auxiliary port connect*/
        uint8_t VBAT1_CON                       : 1; /*0x24.3 VBAT connect bit*/
        uint8_t CELL_CON                        : 1; /*0x24.4 Vcell connect bit*/
        uint8_t OW_TRIGGER                      : 1; /*0x24.5 setting to 1 Initiates an open-wire test sequence*/
        uint8_t OW_EN                           : 1; /*0x24.6 set to 1 to include an OW test sequence during scans*/
        uint8_t CPMP_EN                         : 1; /*0x24.7 enables the charge pump in idle or scan modes if set to 1*/
    } value_b;

} u_raa489206_pwr_fet_op_t;

/**********************************************************************************************************************
 Cell Balancing
***********************************************************************************************************************/
/*0x25 Cell balancing operation*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t CB_CHRG             : 1; /*0x25.0 Cell balancing charge*/
        uint8_t CB_EOC              : 1; /*0x25.1 Cell balancing end of charge*/
        uint8_t CB_MASK             : 1; /*0x25.2 Cell balancing mask. Prevents adjacent cells from balancing at the same time*/
        uint8_t IEOC_EN             : 1; /*0x25.3 Current end of charge*/
        uint8_t CB_TRIGGER          : 1; /*0x25.4 CEll balancing trigger. When set triggers one cell balancing cycle*/
        uint8_t CB_CONFIG           : 1; /*0x25.5 Cell balancing configuration */
        uint8_t AUTO_CB_EN          : 1; /*0x25.6 Auto balancing enable*/
        uint8_t CB_EN               : 1; /*0x25.7 setting this bit enables cell balancing*/
    } value_b;
} u_raa489206_cb_op_register_t;

/*0x26-0x27 Cell balancing Cell state*/
typedef union u_two_byte_lsb u_raa489206_cb_cell_state_t;

/*0x2A Minimum delta threshold*/
typedef uint8_t raa489206_cb_min_delta_th_t;

/*0x2B Cell balancing maximum threshold*/
typedef uint8_t raa489206_cb_max_th_t;

/*0x2D Voltage end of charge threshold*/
typedef uint8_t raa489206_veoc_th_t;

/*0x10 Current end of charge threshold*/
typedef uint8_t raa489206_ieoc_th_t;

/*Cell balancing timers*/
union u_raa489206_cb_timer
{
    uint8_t value;

    struct
    {
        uint8_t UNIT            : 1; /*timer unit: 0: ms (default), 1: s*/
        uint8_t CB_TIMER        : 7; /*Cell balancing unit*/
    }value_b;
} ;

typedef enum e_raa489206_cb_fets_drive_config
{
    RAA489206_CB_FETS_DRIVE_INT  =   0x00, //Drive internal FETs
    RAA489206_CB_FETS_DRIVE_EXT  =   0x01, //Drive external FETs
} e_raa489206_cb_fets_drive_config;

/*0x28 Cell balancing ON timer*/
typedef union u_raa489206_cb_timer u_raa489206_cbon_timer_t;

/*0x28 Cell balancing OFF timer*/
typedef union u_raa489206_cb_timer u_raa489206_cboff_timer_t;

/**********************************************************************************************************************
 System Faults and Status
***********************************************************************************************************************/

/* 0x63 Priority fault: Failures related to the battery pack */
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t OVF                     : 1; /*0x63.0 (Any) Vcell over-voltage fault*/
        uint8_t UVF                     : 1; /*0x63.1 (Any) Vcell under-voltage fault*/
        uint8_t DSCF                    : 1; /*0x63.2 Discharge short current fault*/
        uint8_t DOCF                    : 1; /*0x63.3 Discharge over-temperature fault*/
        uint8_t COCF                    : 1; /*0x63.4 Charge overcurrent fault*/
        uint8_t IOTF                    : 1; /*0x63.5 Internal over-temperature fault */
        uint8_t OWF                     : 1; /*0x63.6 Open-wire fault (ORs Vbat, Vss, xT0 and xT1 OW tests)*/
        uint8_t VCCF                    : 1; /*0x63.7 Under-voltage event at the Vcc pin */
    } value_b;
} u_raa489206_prifault_register_t;

/* 0x83 Priority fault masks: it enable/disable the propagation of faults to the Alert pin.*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t OVFM                     : 1; /*0x83.0 (Any) Vcell over-voltage fault mask*/
        uint8_t UVFM                     : 1; /*0x83.1 (Any) Vcell under-voltage fault mask*/
        uint8_t DSCFM                    : 1; /*0x83.2 Discharge short current fault mask*/
        uint8_t DOCFM                    : 1; /*0x83.3 Discharge over-temperature fault mask*/
        uint8_t COCFM                    : 1; /*0x83.4 Charge overcurrent fault mask*/
        uint8_t IOTFM                    : 1; /*0x83.5 Internal over-temperature fault mask*/
        uint8_t OWFM                     : 1; /*0x83.6 Open-wire fault (ORs Vbat, Vss, xT0 and xT1 OW tests) mask*/
        uint8_t VCCFM                    : 1; /*0x83.7 Under-voltage event at the Vcc pin mask*/
    } value_b;
} u_raa489206_prifault_masks_t;

/*  0x64 ETAUX faults: Failures related to measured voltages at the xT0 and xT1 pins.*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t DUT0                     : 1; /*0x64.0 DUT fault when xT0 Voltage is below DUT0 th*/
        uint8_t DOT0                     : 1; /*0x64.1 DOT fault when xT0 Voltage is below DOT0 th*/
        uint8_t CUT0                     : 1; /*0x64.2 CUT fault when xT0 Voltage is below CUT0 th*/
        uint8_t COT0                     : 1; /*0x64.3 COT fault when xT0 Voltage is below COT0 th*/
        uint8_t DUT1                     : 1; /*0x64.4 DUT fault when xT1 Voltage is below DUT1 th*/
        uint8_t DOT1                     : 1; /*0x64.5 DOT fault when xT1 Voltage is below DOT1 th*/
        uint8_t CUT1                     : 1; /*0x64.6 CUT fault when xT1 Voltage is below CUT1 th*/
        uint8_t COT1                     : 1; /*0x64.7 COT fault when xT1 Voltage is below COT1 th*/
    } value_b;
} u_raa489206_etauxfault_reg_t;

/*  0x84 ETAUX faults masks: Enables/disables propagation of faults to the alert pin.*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t DUT0M                     : 1; /*0x84.0 DUT0 mask*/
        uint8_t DOT0M                     : 1; /*0x84.1 DOT0 mask*/
        uint8_t CUT0M                     : 1; /*0x84.2 CUT0 mask*/
        uint8_t COT0M                     : 1; /*0x84.3 COT0 mask*/
        uint8_t DUT1M                     : 1; /*0x84.4 DUT1 mask*/
        uint8_t DOT1M                     : 1; /*0x84.5 DOT1 mask*/
        uint8_t CUT1M                     : 1; /*0x84.6 CUT1 mask*/
        uint8_t COT1M                     : 1; /*0x84.7 COT1 mask*/
    } value_b;
} u_raa489206_etauxfault_masks_t;

/* 0x65 Other fault register*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t CRCF                    : 1; /*0x65.0 CRC sent by the MCU does not match the internal value */
        uint8_t OWVSS                   : 1; /*0x65.1 Open-wire fault on Vss pin*/
        uint8_t OWBVBAT                 : 1; /*0x65.2 Open-wire fault on Vbat pin*/
        uint8_t OW0                     : 1; /*0x65.3 Open-wire fault on pin xT0*/
        uint8_t OW1                     : 1; /*0x65.4 Open-wire fault on pin xT1*/
        uint8_t CPMP_NRDY               : 1; /*0x65.5 Charge pump not ready because of low Vcpmp voltage*/
        uint8_t VBUVF                   : 1; /*0x65.6 Vbat1 under-voltage fault*/
        uint8_t VBOVF                   : 1; /*0x65.7 Vbat1 over-voltage fault*/
    } value_b;
}u_raa489206_otherfault_reg_t;

/*  0x85 Other fault masks: enables/disables propagation of faults to the alert pin.*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t BUSYM                    : 1; /*0x85.0 Device busy mask */
        uint8_t RSV1                     : 1; /*0x85.1 reserved bit*/
        uint8_t RSV2                     : 1; /*0x85.2 reserved bit*/
        uint8_t RSV3                     : 1; /*0x85.3 reserved bit*/
        uint8_t RSV4                     : 1; /*0x85.4 reserved bit*/
        uint8_t CPMP_NRDYM               : 1; /*0x85.5 charge pump not ready mask*/
        uint8_t VBUVFM                   : 1; /*0x85.6 Vbat1 under-voltage fault*/
        uint8_t VBOVFM                   : 1; /*0x85.7 Vbat1 over-voltage fault*/
    } value_b;
}u_raa489206_otherfault_masks_t;

/*  0x66 Cell balancing and charging status register*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t NEEDCB                    : 1; /*0x66.0 need cell balancing */
        uint8_t TLOTCB                    : 1; /*0x66.1 Too low to perform cell balancing*/
        uint8_t THITCB                    : 1; /*0x66.2 Too high to perform cell balancing*/
        uint8_t DVCF                      : 1; /*0x66.3 Vcell max delta fault*/
        uint8_t VEOC                      : 1; /*0x66.4 Voltage end of charge achieved*/
        uint8_t IEOC                      : 1; /*0x66.5 Current end of charge achieved*/
        uint8_t IOTW                      : 1; /*0x66.6 Internal overtemperature warning*/
        uint8_t BATFULL                   : 1; /*0x66.7 Charging and aouto cell balancing has completed*/
    } value_b;
}u_raa489206_cbstatus_reg_t;

/*  0x86 Cell balancing and charging status masks.*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t NEEDCBM                    : 1; /*0x86.0 need cell balancing mask*/
        uint8_t TLOTCBM                    : 1; /*0x86.1 Too low to perform cell balancing mask*/
        uint8_t THITCBM                    : 1; /*0x86.2 Too high to perform cell balancing mask*/
        uint8_t DVCFM                      : 1; /*0x86.3 Vcell max delta fault mask*/
        uint8_t VEOCM                      : 1; /*0x86.4 Voltage end of charge achieved mask*/
        uint8_t IEOCM                      : 1; /*0x86.5 Current end of charge achieved mask*/
        uint8_t IOTWM                      : 1; /*0x86.6 Internal overtemperature warning mask*/
        uint8_t BATFULLM                   : 1; /*0x86.7 full charge mask*/
    } value_b;
}u_raa489206_cbstatus_masks_t;

/* 0x67 Status register: general status of the RAA489206 */
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t VTMPF                    : 1; /*0x67.0 Undervoltage of the Vtemp pin voltage*/
        uint8_t IREG2                    : 1; /*0x67.1 Regulator over-current while in LPM */
        uint8_t IREG1                    : 1; /*0x67.2 Regulator over-current while in IDLE or SCAN modes*/
        uint8_t OTHERF                   : 1; /*0x67.3 Other faults, i.e., communication time out and oscillator*/
        uint8_t LDPRESI                  : 1; /*0x67.4 Load present indicator*/
        uint8_t CHPRES                   : 1; /*0x67.5 Charger present*/
        uint8_t CHRGI                    : 1; /*0x67.6 Charge current indicator*/
        uint8_t DCHRGI                   : 1; /*0x67.7 Discharge current indicator*/
    } value_b;
}u_raa489206_status_reg_t;

/* 0x87 Status register masks*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t VTMPFM                    : 1; /*0x87.0 Vtemp under-voltage mask*/
        uint8_t IREG2M                    : 1; /*0x87.1 Regulator over-current while in LPM mask*/
        uint8_t IREG1M                    : 1; /*0x87.2 Regulator over-current while in IDLE or SCAN modes mask*/
        uint8_t OTHERFM                   : 1; /*0x87.3 Other faults, i.e., communication time out and oscillator, mask*/
        uint8_t LDPRESIM                  : 1; /*0x87.4 Load present indicator mask*/
        uint8_t CHPRESM                   : 1; /*0x87.5 Charger present mask*/
        uint8_t CHRGIM                    : 1; /*0x87.6 Charge current mask*/
        uint8_t DCHRGIM                   : 1; /*0x87.7 Discharge current mask*/
    } value_b;
}u_raa489206_status_masks_t;

/*  0x68-69 Open-wire Status register*/
typedef union
{
    uint16_t value;
    uint8_t lsb_value;

    struct
    {
        uint16_t lsb                        : 8;
        uint16_t msb                        : 8;
    } lsb_msb;

    struct
    {
        uint16_t OWCELL1                    : 1; /*0x68.0 Indicator of open wire in cell 1*/
        uint16_t OWCELL2                    : 1; /*0x68.1 Indicator of open wire in cell 2*/
        uint16_t OWCELL3                    : 1; /*0x68.2 Indicator of open wire in cell 3*/
        uint16_t OWCELL4                    : 1; /*0x68.3 Indicator of open wire in cell 4*/
        uint16_t OWCELL5                    : 1; /*0x68.4 Indicator of open wire in cell 5*/
        uint16_t OWCELL6                    : 1; /*0x68.5 Indicator of open wire in cell 6*/
        uint16_t OWCELL7                    : 1; /*0x68.6 Indicator of open wire in cell 7*/
        uint16_t OWCELL8                    : 1; /*0x68.7 Indicator of open wire in cell 8*/
        uint16_t OWCELL9                    : 1; /*0x69.0 Indicator of open wire in cell 9*/
        uint16_t OWCELL10                   : 1; /*0x69.1 Indicator of open wire in cell 10*/
        uint16_t OWCELL11                   : 1; /*0x69.2 Indicator of open wire in cell 11*/
        uint16_t OWCELL12                   : 1; /*0x69.3 Indicator of open wire in cell 12*/
        uint16_t OWCELL13                   : 1; /*0x69.4 Indicator of open wire in cell 13*/
        uint16_t OWCELL14                   : 1; /*0x69.5 Indicator of open wire in cell 14*/
        uint16_t OWCELL15                   : 1; /*0x69.6 Indicator of open wire in cell 15*/
        uint16_t OWCELL16                   : 1; /*0x69.7 Indicator of open wire in cell 16*/
    } value_b;
}u_raa489206_owstatus_reg_t;

/*  0x88-99 Open-wire Status masks*/
typedef union
{
    uint16_t value;
    uint8_t lsb_value;

    struct
    {
        uint16_t lsb                        : 8;
        uint16_t msb                        : 8;
    } lsb_msb;

    struct
    {
        uint16_t OWCELL1M                    : 1; /*0x88.0 OW cell1 mask*/
        uint16_t OWCELL2M                    : 1; /*0x88.1 OW cell2 mask*/
        uint16_t OWCELL3M                    : 1; /*0x88.2 OW cell3 mask*/
        uint16_t OWCELL4M                    : 1; /*0x88.3 OW cell4 mask*/
        uint16_t OWCELL5M                    : 1; /*0x88.4 OW cell5 mask*/
        uint16_t OWCELL6M                    : 1; /*0x88.5 OW cell6 mask*/
        uint16_t OWCELL7M                    : 1; /*0x88.6 OW cell7 mask*/
        uint16_t OWCELL8M                    : 1; /*0x88.7 OW cell8 mask*/
        uint16_t OWCELL9M                    : 1; /*0x89.0 OW cell9 mask*/
        uint16_t OWCELL10M                   : 1; /*0x89.1 OW cell10 mask*/
        uint16_t OWCELL11M                   : 1; /*0x89.2 OW cell11 mask*/
        uint16_t OWCELL12M                   : 1; /*0x89.3 OW cell12 mask*/
        uint16_t OWCELL13M                   : 1; /*0x89.4 OW cell13 mask*/
        uint16_t OWCELL14M                   : 1; /*0x89.5 OW cell14 mask*/
        uint16_t OWCELL15M                   : 1; /*0x89.6 OW cell15 mask*/
        uint16_t OWCELL16M                   : 1; /*0x89.7 OW cell16 mask*/
    } value_b;
}u_raa489206_ow_masks_t;

/**********************************************************************************************************************
 System Operation
***********************************************************************************************************************/

/*0x2E Scan operation register*/
typedef union
{
    uint8_t value;

    struct
    {
        uint8_t SCAN_DELAY                      : 3; /*Scan delay*/
        uint8_t LPT                             : 3; /*Low power timer*/
        uint8_t SYS_MODE                        : 2; /*System mode*/
    }value_b;
} u_raa489206_scanop_register_t;

/**********************************************************************************************************************
 END OF RAA489206 SYSTEM REGISTERS TYPES DEFINITIONS
